gooberx/Zigbee_demo_workshop_final/STM32_WPAN/App/app_zigbee.c
}

void APP_ZIGBEE_LaunchPushButtonTask(uint32_t buttonFlag)
{
  osThreadFlagsSet(OsTaskPushButtonId,buttonFlag);
} /* APP_ZIGBEE_LaunchPushButtonTask */

void APP_ZIGBEE_LaunchPushButton3ShortPressTask(void)
{
	zigbee_app_info.startupControl=ZbStartTypeJoin;
	osThreadFlagsSet(OsTaskNwkFormId, 1);
} /* APP_ZIGBEE_LaunchPushButton3ShortPressTask */

void APP_ZIGBEE_LaunchPushButton3LongPressTask(void)
{
	zigbee_app_info.startupControl=ZbStartTypeTouchlink;
	osThreadFlagsSet(OsTaskNwkFormId, 1);
} /* APP_ZIGBEE_LaunchPushButton3LongPressTask */

/**
 * @brief  Function used to process push of different SW buttons
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ProcessPushButton(void * argument)
{
  UNUSED(argument);
  uint32_t flags=0;
  for(;;)
  {
    uint32_t expected_fags;
    expected_fags = BUTTON_SW1_PIN | BUTTON_SW2_PIN;

    osThreadFlagsWait(expected_fags,osFlagsWaitAny|osFlagsNoClear,osWaitForever);
    flags=osThreadFlagsGet();
    if (flags & BUTTON_SW1_PIN)
    {
      APP_ZIGBEE_SW1_Process();
      osThreadFlagsClear(BUTTON_SW1_PIN);
    }

    if (flags & BUTTON_SW2_PIN)
    {
      APP_ZIGBEE_SW2_Process();
      osThreadFlagsClear(BUTTON_SW2_PIN);
    }
  }
} /* APP_ZIGBEE_ProcessPushButton */

/**
 * @brief  Function used to process push of SW1 button
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_SW1_Process(void)
{
  APP_DBG("APP_ZIGBEE_SW1_Process.");
} /* APP_ZIGBEE_SW1_Process */

/**
 * @brief  Function used to process push of SW2 button
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_SW2_Process(void)
{
  APP_DBG("APP_ZIGBEE_SW2_Process.");
} /* APP_ZIGBEE_SW2_Process */

/* USER CODE END FD_LOCAL_FUNCTIONS */
